CBitmapRenderTarget.m_pBitmapRenderTarget
A pointer to an ID2D1BitmapRenderTarget object.

CBitmapRenderTarget.GetBitmap(CD2DBitmap*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Retrieves the bitmap for this render target. The returned bitmap can be used for drawing operations.
Returns: If the method succeeds, it returns TRUE. Otherwise, it returns FALSE.
bitmap: When this method returns, contains the valid bitmap for this render target. This bitmap can be used for drawing operations.

CBitmapRenderTarget.op_Implicit~ID2D1BitmapRenderTarget*
Returns ID2D1BitmapRenderTarget interface
Returns:
Pointer to an ID2D1BitmapRenderTarget interface or NULL if object is not initialized yet.

CBitmapRenderTarget.GetBitmapRenderTarget
Returns ID2D1BitmapRenderTarget interface
Returns:
Pointer to an ID2D1BitmapRenderTarget interface or NULL if object is not initialized yet.

CBitmapRenderTarget.Detach
Detaches render target interface from the object
Returns:
Pointer to detached render target interface.

CBitmapRenderTarget.Attach(ID2D1BitmapRenderTarget*)
Attaches existing render target interface to the object
pTarget: Existing render target interface. Cannot be NULL

CBitmapRenderTarget.#ctor
Constructs a CBitmapRenderTarget object.